Revit 2021.1 API
FabricationService.GetGroupName Method
 Gets the name of a group based on group index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2016
Syntax
C#
public string GetGroupName(
	int group
)
Visual Basic
Public Function GetGroupName ( _
	group As Integer _
) As String
Visual C++
public:
String^ GetGroupName(
	int group
)
Parameters
group
Type: System.Int32
 The index of the group.
Return Value
 The name of the group.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  the index group is not larger or equal to 0 and less than GroupCount
See Also
FabricationService Class
Autodesk.Revit.DB Namespace